app/views/users/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
		<div>
			<%= order.created_at.strftime('%Y/%m/%d') %>  <%= order.order_status %>

SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ?  [["user_id", 1]]
---

			<% order.order_items.each do |oi| %>