app/views/items/index.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
		    	<h4><%= "第#{i}位" %></h4>
		   		<% item = Item.find(item_key) %>