app/views/items/show.html.erb

SELECT "discs".* FROM "discs" WHERE "discs"."item_id" = ?  [["item_id", 1]]
---
			<h3>収録曲一覧</h3>
			<% @item.discs.each do |d| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
---
			<p><%= @satisfaction_count %>件</p>
			<% @item.reviews.each do |r| %>