app/controllers/items_controller.rb

SELECT COUNT(*) FROM "items"
SELECT  "items".* FROM "items" ORDER BY impressions_count DESC LIMIT ?  [["LIMIT", 10]]
SELECT  "items".* FROM "items" ORDER BY impressions_count DESC LIMIT ?  [["LIMIT", 4]]
---
	def index
		@items = Item.page(params[:page]).reverse_order
		@hash_sales_ranking = OrderItem.rank_sales_items
		@most_viewed = Item.order('impressions_count DESC').take(4)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT AVG("reviews"."satisfaction") FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
---
	def show
		@item = Item.find(params[:id])
	    impressionist(@item, nil)
	    @cart = Cart.new
        @satisfaction_average = @item.reviews.average(:satisfaction)
        @satisfaction_count = @item.reviews.length

SELECT  "items".* FROM "items" ORDER BY impressions_count DESC LIMIT ?  [["LIMIT", 4]]
SELECT "artists".* FROM "artists" WHERE (artist_name LIKE '%カ%')
SELECT "items".* FROM "items" INNER JOIN "discs" ON "discs"."item_id" = "items"."id" INNER JOIN "songs" ON "songs"."disc_id" = "discs"."id" WHERE (song LIKE '%カ%')
---
	def search
		@hash_sales_ranking = OrderItem.rank_sales_items
		@most_viewed = Item.order('impressions_count DESC').take(4)
		if params[:search_flag] == "1"
			@artists = Artist.where("artist_name LIKE ?", "%#{params[:search_word]}%")
			@items = []
			@artists.each do |a|
				a.items.each do |i|