app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def index
		@items = Item.page(params[:page]).where(item_delete_flag: 0).per(14).reverse_order
		@day = Date.today.strftime('%y/%m/%d')
		@week_ago = Date.today.ago(1.week).strftime('%y/%m/%d')
		@hash_sales_ranking = OrderItem.rank_sales_items
		@item_sales_key = @hash_sales_ranking.keys
		@item_sales_ranking = []
		@item_sales_key.each do |i|
			item  = Item.find(i)