app/controllers/reviews_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
SELECT AVG("reviews"."satisfaction") FROM "reviews" WHERE "reviews"."item_id" = ?  [["item_id", 1]]
---
	def new
		@review = Review.new
		@item = Item.find(1)    # 仮で1置いてます
		@order_item = OrderItem.find(@item.id)
		@satisfaction_average = @item.reviews.average(:satisfaction)
		@satisfaction_count = @item.reviews.length

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "item_id", "review_title", "review_content", "satisfaction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
    	@review = Review.new(review_params)
    	@review.user_id = current_user.id
    	@item = Item.find(1)    # 仮で1置いてます
    	@review.item_id = @item.id
    	@review.save