app/controllers/users_controller.rb

	def show
	  @user = current_user
	  @addresses = Address.where(user_id: @user)
	  @orders = @user.orders
	  @order_items = OrderItem.where(user_id: @user)
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ?  [["user_id", 1]]