app/models/order_item.rb

SELECT SUM("order_items"."order_number") AS sum_order_number, "order_items"."item_id" AS order_items_item_id FROM "order_items" GROUP BY "order_items"."item_id"
---
	def self.rank_sales_items
		self.order('sum_order_number desc').limit(4).group(:item_id).sum(:order_number)